// src/components/ui/icons/MusicEighthNote.tsx
import type { SVGProps } from 'react';

/**
 * 八分音符 (Eighth Note)
 */
export const MusicEighthNote = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    viewBox="0 0 10240 10240"
    fill="currentColor"
    strokeWidth="1.5"
    strokeLinecap="round"
    strokeLinejoin="round"
    {...props}
  >
    <g>
      <path
        d="M3368 9519 c-127 -18 -269 -68 -376 -131 -31 -18 -93 -69 -137 -113 -135 -134 -195 -289 -195 -503 0 -381 217 -732 615 -997 344 -230 770 -339 1192 -307 90 7 188 22 248 37 54 13 100 23 102 21 2 -2 5 -1515 7 -3361 2 -3223 3 -3358 20 -3371 26 -19 110 -27 228 -22 87 3 110 7 147 28 74 42 83 62 93 202 26 397 144 771 347 1098 116 187 322 437 580 704 268 278 348 363 440 470 401 467 654 959 740 1436 58 321 53 690 -15 995 -39 179 -104 368 -188 551 -99 217 -291 555 -459 812 -96 145 -102 152 -134 152 -31 0 -33 -2 -33 -34 0 -18 11 -62 24 -97 138 -370 250 -802 307 -1184 29 -201 37 -566 15 -735 -69 -525 -276 -942 -651 -1315 -282 -281 -657 -485 -900 -489 l-70 -1 -5 2515 -5 2515 -22 77 c-116 406 -521 783 -1033 961 -101 35 -258 73 -353 86 -90 13 -445 13 -529 0z">
      </path>
    </g>
  </svg>
);

MusicEighthNote.displayName = 'MusicEighthNote';