// src/components/ui/icons/MusicQuarterNote.tsx
import type { SVGProps } from 'react';

/**
 * 四分音符 (Quarter Note)
 */
export const MusicQuarterNote = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    viewBox="0 0 10240 10240"
    fill="currentColor"
    strokeWidth="1.5"
    strokeLinecap="round"
    strokeLinejoin="round"
    {...props}
  >
    <g>
      <path
        d="M3675 9515 c-93 -17 -215 -59 -295 -101 -191 -101 -349 -296 -405 -499 -23 -81 -32 -341 -15 -443 68 -427 408 -892 848 -1159 248 -150 516 -244 774 -272 203 -23 444 -7 589 38 l59 19 0 -3209 c0 -3162 0 -3208 19 -3219 12 -6 103 -10 225 -10 185 0 206 2 214 17 5 10 31 81 57 158 188 554 362 848 893 1514 300 375 414 546 552 826 130 262 203 497 241 775 19 134 16 497 -4 627 -54 338 -175 649 -363 929 -78 117 -269 352 -306 379 -13 8 -42 15 -65 15 l-43 0 0 -49 c0 -34 15 -88 49 -177 191 -507 276 -966 242 -1304 -67 -662 -423 -1168 -1109 -1576 l-107 -64 -5 2398 c-4 1856 -2 2405 7 2432 41 118 47 166 48 340 0 107 -5 198 -13 235 -75 341 -258 640 -550 897 -108 95 -249 200 -322 239 -16 9 -36 22 -44 29 -21 17 -88 50 -102 50 -7 0 -29 9 -51 20 -55 27 -217 86 -293 104 -36 9 -74 21 -85 25 -68 30 -508 41 -640 16z">
      </path>
    </g>
  </svg>
);

MusicQuarterNote.displayName = 'MusicQuarterNote';